maxgerhardt/micropython/ports/ch32/system_ch32h417_v3f.c
/* Port-owned copy of the vendor's system file for the V3F core.
 *
 * Upstream ships this per-example under <example>/V3F/User/ rather than in
 * EVT/EXAM/SRC, because it is configuration rather than library code: the
 * SYSCLK_* macro below selects which clock tree SystemInit() programs. That is
 * why lib/ch32h417lib does not carry it and this port does, the same way
 * ports/stm32 owns system_stm32.c alongside lib/stm32lib.
 *
 * Taken verbatim from PlatformIO's framework-wch-noneos-sdk 2.30000.0
 * (System/ch32h417/v3f/), so it stays diffable against a future vendor drop.
 * The SYSCLK_* macro is supplied by mpconfigboard.mk and boot_v3f/Makefile
 * WITH a value -- see the note there; the #defines below stay commented out
 * exactly as the vendor left them.
 */
/********************************** (C) COPYRIGHT *******************************
* File Name          : system_ch32h417.c
* Author             : WCH
* Version            : V1.0.1
* Date               : 2025/10/16
* Description        : CH32H417 Device Peripheral Access Layer System Source File.
*                      For HSE = 25Mhz
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32h417.h" 

/* 
* Uncomment the line corresponding to the desired System clock (SYSCLK) frequency (after 
* reset the HSI is used as SYSCLK source).
* If none of the define below is enabled, the HSI is used as System clock source. 
*/
// #define SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE    400000000
// #define SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE    480000000
// #define SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI    400000000
// #define SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI    480000000

/*Only suitable for commercial applications, with a temperature not exceeding 70 ℃ and good heat dissipation*/
/* // #define SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSE    480000000
// #define SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSI    480000000 */

/* Clock Definitions */
uint32_t HCLKClock;
#ifdef SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE
uint32_t SystemClock = SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE;         /* System Clock Frequency */
uint32_t SystemCoreClock = 100000000;
#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE
uint32_t SystemClock = SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE;        /* System Clock Frequency */
uint32_t SystemCoreClock = 120000000;
#elif defined SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI
uint32_t SystemClock = SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI;        /* System Clock Frequency */
uint32_t SystemCoreClock = 100000000;
#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI
uint32_t SystemClock = SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI;       /* System Clock Frequency */
uint32_t SystemCoreClock = 120000000;

#elif defined SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSE
uint32_t SystemClock = SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSE;         /* System Clock Frequency */
uint32_t SystemCoreClock = 120000000;

#elif defined SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSI
uint32_t SystemClock = SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSI;         /* System Clock Frequency */
uint32_t SystemCoreClock = 120000000;



#else

uint32_t SystemClock = HSI_VALUE;       /* System Clock Frequency */
uint32_t SystemCoreClock = HSI_VALUE;
#endif

static __I uint8_t PLLMULTB[32] = {4,6,7,8,17,9,19,10,21,11,23,12,25,13,14,15,16,17,18,19,20,22,24,26,28,30,32,34,36,38,40,59};
static __I uint8_t HBPrescTB[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
static __I uint8_t SERDESPLLMULTB[16] = {25, 28, 30, 32, 35, 38, 40, 45, 50, 56, 60, 64, 70, 76, 80, 90};
static __I uint8_t FPRETB[4] = {0, 1, 2, 2};



/* system_private_function_proto_types */
static void SetSysClock(void);

#ifdef SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE
static void SetSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE( void );
#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE
static void SetSYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE( void );
#elif defined SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI
static void SetSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI( void );
#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI
static void SetSYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI( void );

#elif defined SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSE
static void SetSYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSE( void );
#elif defined SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSI
static void SetSYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSI( void );

#endif

/*********************************************************************
 * @fn      SystemInit
 *
 * @brief   Setup the microcontroller system Initialize the Embedded Flash Interface,
 *        the PLL and update the SystemCoreClock variable.
 *
 * @return  none
 */
void SystemInit (void)
{
  RCC->CTLR |= (uint32_t)0x00000001;
  RCC->CFGR0 &= (uint32_t)0x305C0000;
  while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x00)
  {
  }
  RCC->CFGR0 &= (uint32_t)0xFFBFFFFF;

  RCC->PLLCFGR &= (uint32_t)0x7FFFFFFF;

  RCC->CTLR &= (uint32_t)0x6AA6FFFF;
  RCC->CTLR &= (uint32_t)0xFFFBFFFF;

  RCC->PLLCFGR &= (uint32_t)0x0FFFC000;
  RCC->PLLCFGR |= (uint32_t)0x00000004;

  RCC->INTR = 0x00FF0000;
  RCC->CFGR2 &= 0x0C600000;
  RCC->PLLCFGR2 &= 0xFFF0E080;
  RCC->PLLCFGR2 |= 0x00080020;
  
  SetSysClock();
}

/*********************************************************************
 * @fn      SetSysClock
 *
 * @brief   Sets System clock frequency.
 *          Sets V5F Core clock frequency.
 *          Sets V3F Core clock frequency.
 *          configure HCLK prescalers.
 *
 * @return  none
 */
static void SetSysClock(void)
{
     GPIO_IPD_Unused();
#ifdef SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE
    SetSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE();
#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE
    SetSYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE();
#elif defined SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI
    SetSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI();
#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI
    SetSYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI();

#elif defined SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSE
    SetSYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSE();
#elif defined SYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSI
    SetSYSCLK_480M_CoreCLK_V5F_480M_V3F_120M_HSI();

#endif
 
