maxgerhardt/micropython/ports/ch32/system_ch32h417_v3f.c
  }
  else
  { 
        /* If HSE fails to start-up, the application will have wrong clock
     * configuration. User can add here some code to deal with this error 
         */
  }  
}

#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE

/*********************************************************************
 * @fn      SetSYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE
 *
 * @brief   Sets System clock frequency to 480MHz.
 *          Sets V5F Core clock frequency to 240MHz.
 *          Sets V3F Core clock frequency to 120MHz.
 *          configure HCLK prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSE(void)
{
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0, FLASH_Temp = 0;

  RCC->CTLR |= ((uint32_t)RCC_HSEON);
 
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CTLR & RCC_HSERDY;
    StartUpCounter++;  
  } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

  if ((RCC->CTLR & RCC_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }  

  if (HSEStatus == (uint32_t)0x01)
  {
    /* Select 25MHz as USBHS PLL clock reference */
    RCC->PLLCFGR2 &= (uint32_t)((uint32_t)~(RCC_USBHSPLL_REFSEL)); 

    /* Select HSE as USBHS PLL clock source */
    RCC->PLLCFGR2 &= (uint32_t)((uint32_t)~(RCC_USBHSPLLSRC)); 

    /* Wait till HSE is used as USBHS PLL clock source */
    while ((RCC->PLLCFGR2 & (uint32_t)RCC_USBHSPLLSRC) != (uint32_t)0x00)
    {
    }

    /* Enable USBHS PLL */
    RCC->CTLR |= (uint32_t)RCC_USBHS_PLLON;

    /* Wait till USBHS PLL is ready */
    while ((RCC->CTLR & (uint32_t)RCC_USBHS_PLLRDY) != (uint32_t)RCC_USBHS_PLLRDY)
    {
    }  
 
    /* Select USBHS_PLL Clock as SYSPLL clock source */
    RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_SYSPLL_GATE)); 
    RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_SYSPLL_SEL));
    RCC->PLLCFGR |= (uint32_t)((uint32_t)(RCC_SYSPLL_USBHS));

    /* Wait till USBHS is used as system clock source */
    while ((RCC->PLLCFGR & (uint32_t)RCC_SYSPLL_USBHS) != (uint32_t)RCC_SYSPLL_USBHS)
    {
    }

    /* V5F core clock = SYSCLK */
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_HPRE));
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2; 

    /* V3F core clock = HCLK = SYSCLK/4 */
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_FPRE));
    RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV2;  

    /* Select FLASH clock frequency*/
    FLASH_Temp = FLASH->ACTLR;
    FLASH_Temp &= ~((uint32_t)0x3);
    FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV2;
    FLASH->ACTLR = FLASH_Temp;

    /* Select PLL as system clock source */
    RCC->PLLCFGR |= (uint32_t)RCC_SYSPLL_GATE; 
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    

    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }

  }
  else
  { 
        /* If HSE fails to start-up, the application will have wrong clock
     * configuration. User can add here some code to deal with this error 
         */
  }   
}

#elif defined SYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI

/*********************************************************************
 * @fn      SetSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI
 *
 * @brief   Sets System clock frequency to 400MHz.
 *          Sets V5F Core clock frequency to 400MHz.
 *          Sets V3F Core clock frequency to 100MHz.
 *          configure HCLK prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSI(void)
{
  __IO uint32_t FLASH_Temp = 0;
  /* configure PLL Clock */  
  RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_PLLMUL)); 
  RCC->PLLCFGR |= (uint32_t)RCC_PLLMUL16;   
  RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_PLL_SRC_DIV)); 
  RCC->PLLCFGR |= (uint32_t)RCC_PLL_SRC_DIV1;
  RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_PLLSRC)); 
  RCC->PLLCFGR |= (uint32_t)RCC_PLLSRC_HSI;

  /* Wait till HSI clock is used as PLL clock source */
  while ((RCC->PLLCFGR & (uint32_t)RCC_PLLSRC) != (uint32_t)RCC_PLLSRC_HSI)
  {
  }     

  /* Enable PLL */
  RCC->CTLR |= RCC_PLLON;

  /* Wait till PLL is ready */
  while((RCC->CTLR & RCC_PLLRDY) != (uint32_t)RCC_PLLRDY)
  {
  }

  /* Select PLL Clock as SYSPLL clock source */
  RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_SYSPLL_GATE)); 
  RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_SYSPLL_SEL)); 

  /* Wait till PLL is used as system clock source */
  while ((RCC->PLLCFGR & (uint32_t)RCC_SYSPLL_SEL) != (uint32_t)0x00)
  {
  }

  /* V5F core clock = SYSCLK */
  RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_HPRE));
  RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1; 

  /* V3F core clock = HCLK = SYSCLK/4 */
  RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_FPRE));
  RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV4;  

  /* Select FLASH clock frequency*/
  FLASH_Temp = FLASH->ACTLR;
  FLASH_Temp &= ~((uint32_t)0x3);
  FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV2;
  FLASH->ACTLR = FLASH_Temp;

  /* Select PLL as system clock source */
  RCC->PLLCFGR |= (uint32_t)RCC_SYSPLL_GATE; 
  RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
  RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    

  /* Wait till PLL is used as system clock source */
  while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
  {
  } 
}

#elif defined SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI

/*********************************************************************
 * @fn      SYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI
 *
 * @brief   Sets System clock frequency to 480MHz.
 *          Sets V5F Core clock frequency to 240MHz.
 *          Sets V3F Core clock frequency to 120MHz.
 *          configure HCLK prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_480M_CoreCLK_V5F_240M_V3F_120M_HSI(void)
{
  __IO uint32_t FLASH_Temp = 0;
  /* Select 25MHz as USBHS PLL clock reference */
  RCC->PLLCFGR2 &= (uint32_t)((uint32_t)~(RCC_USBHSPLL_REFSEL)); 

  /* Select HSI as USBHS PLL clock source */
  RCC->PLLCFGR2 &= (uint32_t)((uint32_t)~(RCC_USBHSPLLSRC)); 
  RCC->PLLCFGR2 |= (uint32_t)RCC_USBHSPLLSRC_HSI;

  /* Wait till HSI is used as USBHS PLL clock source */
  while ((RCC->PLLCFGR2 & (uint32_t)RCC_USBHSPLLSRC) != (uint32_t)0x01)
  {
  }

  /* Enable USBHS PLL */
  RCC->CTLR |= (uint32_t)RCC_USBHS_PLLON;

  /* Wait till USBHS PLL is ready */
  while ((RCC->CTLR & (uint32_t)RCC_USBHS_PLLRDY) != (uint32_t)RCC_USBHS_PLLRDY)
  {
  }  

